app/Http/Controllers/Admin/SellController.php

    public function create()
    {
        $gender_categories = GenderCategory::orderBy('sort_no')->get();
---
select * from `gender_categories` order by `sort_no` asc